[
		{
			"name": "Magical Tinkering",
			"source": "TCE",
			"page": 9,
			"otherSources": [
				{
					"source": "ERLW",
					"page": 54
				}
			],
			"className": "Artificer",
			"classSource": "TCE",
			"level": 1,
			"entries": [
				"At 1st level, you learn how to invest a spark of magic into mundane objects. To use this ability, you must have {@item thieves' tools|PHB} or {@item artisan's tools|PHB} in hand. You then touch a Tiny nonmagical object as an action and give it one of the following magical properties of your choice:",
				{
					"type": "list",
					"items": [
						"The object sheds bright light in a 5-foot radius and dim light for an additional 5 feet.",
						"Whenever tapped by a creature, the object emits a recorded message that can be heard up to 10 feet away. You utter the message when you bestow this property on the object, and the recording can be no more than 6 seconds long.",
						"The object continuously emits your choice of an odor or a nonverbal sound (wind, waves, chirping, or the like). The chosen phenomenon is perceivable up to 10 feet away.",
						"A static visual effect appears on one of the object's surfaces. This effect can be a picture, up to 25 words of text, lines and shapes, or a mixture of these elements, as you like."
					]
				},
				"The chosen property lasts indefinitely. As an action, you can touch the object and end the property early.",
				"You can bestow magic on multiple objects, touching one object each time you use this feature, though a single object can only bear one property at a time. The maximum number of objects you can affect with this feature at one time is equal to your Intelligence modifier (minimum of one object). If you try to exceed your maximum, the oldest property immediately ends, and then the new property applies."
			]
		},
		{
			"name": "Optional Rule: Firearm Proficiency",
			"source": "TCE",
			"page": 9,
			"otherSources": [
				{
					"source": "ERLW",
					"page": 54
				}
			],
			"className": "Artificer",
			"classSource": "TCE",
			"level": 1,
			"entries": [
				"The secrets of creating and operating gunpowder weapons have been discovered in various corners of the D&D multiverse. If your Dungeon Master uses the rules on firearms in {@book chapter 9|DMG|9|Firearms} of the {@book Dungeon Master's Guide|DMG} and your artificer has been exposed to the operation of such weapons, your artificer is proficient with them."
			]
		},
		{
			"name": "Spellcasting",
			"source": "TCE",
			"page": 9,
			"otherSources": [
				{
					"source": "ERLW",
					"page": 54
				}
			],
			"className": "Artificer",
			"classSource": "TCE",
			"level": 1,
			"entries": [
				"You have studied the workings of magic and how to channel it through objects. As a result, you have gained the ability to cast spells. To observers, you don't appear to be casting spells in a conventional way; you look as if you're producing wonders using mundane items or outlandish inventions.",
				{
					"type": "entries",
					"name": "Tools Required",
					"entries": [
						"You produce your artificer spell effects through your tools. You must have a spellcasting focus—specifically {@item thieves' tools|phb} or some kind of {@item artisan's tools|phb|artisan's tool}—in hand when you cast any spell with this Spellcasting feature (meaning the spell has an 'M' component when you cast it). You must be proficient with the tool to use it in this way. See {@book chapter 5|PHB|4}, \"Equipment,\" in the {@book Player's Handbook|PHB} for descriptions of these tools.",
						"After you gain the Infuse Item feature at 2nd level, you can also use any item bearing one of your infusions as a spellcasting focus.",
						{
							"type": "inset",
							"name": "The Magic of Artifice",
							"entries": [
								"As an artificer, you use tools when you cast your spells. When describing your spellcasting, think about how you're using a tool to perform the spell effect. If you cast {@spell cure wounds} using {@item alchemist's supplies|PHB}, you could be quickly producing a salve. If you cast it using {@item tinker's tools|PHB}, you might have a miniature mechanical spider that binds wounds. When you cast {@spell poison spray}, you could fling foul chemicals or use a wand that spits venom. The effect of the spell is the same as for a spellcaster of any other class, but your method of spellcasting is special.",
								"The same principle applies when you prepare your spells. As an artificer, you don't study a spellbook or pray to prepare your spells. Instead, you work with your tools and create the specialized items you'll use to produce your effects. If you replace {@spell cure wounds} with {@spell heat metal}, you might be altering the device you use to heal—perhaps modifying a tool so that it channels heat instead of healing energy.",
								"Such details don't limit you in any way or provide you with any benefit beyond the spell's effects. You don't have to justify how you're using tools to cast a spell. But describing your spellcasting creatively is a fun way to distinguish yourself from other spellcasters."
							]
						}
					]
				},
				{
					"type": "entries",
					"name": "Cantrips (0-Level Spells)",
					"entries": [
						"At 1st level, you know two cantrips of your choice from the {@filter artificer spell list|spells|level=0|class=Artificer}. At higher levels, you learn additional artificer cantrips of your choice, as shown in the Cantrips Known column of the Artificer table.",
						"When you gain a level in this class, you can replace one of the artificer cantrips you know with another cantrip from the artificer spell list."
					]
				},
				{
					"type": "entries",
					"name": "Preparing and Casting Spells",
					"entries": [
						"The Artificer table shows how many spell slots you have to cast your artificer spells. To cast one of your artificer spells of 1st level or higher, you must expend a slot of the spell's level or higher. You regain all expended spell slots when you finish a long rest.",
						"You prepare the list of artificer spells that are available for you to cast, choosing from the {@filter artificer spell list|spells|class=Artificer}. When you do so, choose a number of artificer spells equal to your Intelligence modifier + half your artificer level, rounded down (minimum of one spell). The spells must be of a level for which you have spell slots.",
						"For example, if you are a 5th-level artificer, you have four 1st-level and two 2nd-level spell slots. With an Intelligence of 14, your list of prepared spells can include four spells of 1st or 2nd level, in any combination. If you prepare the 1st-level spell {@spell cure wounds}, you can cast it using a 1st-level or a 2nd-level slot. Casting the spell doesn't remove it from your list of prepared spells.",
						"You can change your list of prepared spells when you finish a long rest. Preparing a new list of artificer spells requires time spent tinkering with your spellcasting focuses: at least 1 minute per spell level for each spell on your list."
					]
				},
				{
					"type": "entries",
					"name": "Spellcasting Ability",
					"entries": [
						"Intelligence is your spellcasting ability for your artificer spells; your understanding of the theory behind magic allows you to wield these spells with superior skill. You use your Intelligence whenever an artificer spell refers to your spellcasting ability. In addition, you use your Intelligence modifier when setting the saving throw DC for an artificer spell you cast and when making an attack roll with one.",
						{
							"type": "abilityDc",
							"name": "Spell",
							"attributes": [
								"int"
							]
						},
						{
							"type": "abilityAttackMod",
							"name": "Spell",
							"attributes": [
								"int"
							]
						}
					]
				},
				{
					"type": "entries",
					"name": "Ritual Casting",
					"entries": [
						"You can cast an artificer spell as a ritual if that spell has the ritual tag and you have the spell prepared."
					]
				}
			]
		},
		{
			"name": "Infuse Item",
			"source": "TCE",
			"page": 9,
			"otherSources": [
				{
					"source": "ERLW",
					"page": 54
				}
			],
			"className": "Artificer",
			"classSource": "TCE",
			"level": 2,
			"entries": [
				"At 2nd level, you gain the ability to imbue mundane items with certain magical infusions. The magic items you create with this feature are effectively prototypes of permanent items.",
				{
					"type": "refClassFeature",
					"classFeature": "Infusions Known|Artificer|TCE|2"
				},
				{
					"type": "inset",
					"name": "Artificer Infusions",
					"entries": [
						"Artificers have invented numerous magical infusions, extraordinary processes that rapidly create magic items. To many, artificers seem like wonderworkers, accomplishing in hours what others need weeks to complete.",
						"The description of each of the following infusions details the type of item that can receive it, along with whether the resulting magic item requires attunement.",
						"Some infusions specify a minimum artificer level. You can't learn such an infusion until you are at least that level.",
						"Unless an infusion's description says otherwise, you can't learn an infusion more than once."
					]
				},
				{
					"type": "entries",
					"name": "Infusing an Item",
					"entries": [
						"Whenever you finish a long rest, you can touch a nonmagical object and imbue it with one of your artificer infusions, turning it into a magic item. An infusion works on only certain kinds of objects, as specified in the infusion's description. If the item requires attunement, you can attune yourself to it the instant you infuse the item. If you decide to attune to the item later, you must do so using the normal process for attunement (see \"Attunement\" in chapter 7 of the {@book Dungeon Master's Guide|DMG}).",
						"Your infusion remains in an item indefinitely, but when you die, the infusion vanishes after a number of days have passed equal to your Intelligence modifier (minimum of 1 day). The infusion also vanishes if you give up your knowledge of the infusion for another one.",
						"You can infuse more than one nonmagical object at the end of a long rest; the maximum number of objects appears in the Infused Items column of the Artificer table. You must touch each of the objects, and each of your infusions can be in only one object at a time. Moreover, no object can bear more than one of your infusions at a time. If you try to exceed your maximum number of infusions, the oldest infusion immediately ends, and then the new infusion applies.",
						"If an infusion ends on an item that contains other things, like a bag of holding, its contents harmlessly appear in and around its space."
					]
				}
			]
		},
		{
			"name": "Infusions Known",
			"source": "TCE",
			"page": 9,
			"otherSources": [
				{
					"source": "ERLW",
					"page": 54
				}
			],
			"className": "Artificer",
			"classSource": "TCE",
			"level": 2,
			"header": 1,
			"entries": [
				"When you gain this feature, pick four artificer infusions to learn, choosing from the \"{@filter Artificer Infusions|optionalfeatures|feature type=ai|source=ERLW}\" section at the end of the class's description. You learn additional infusions of your choice when you reach certain levels in this class, as shown in the Infusions Known column of the Artificer table.",
				"Whenever you gain a level in this class, you can replace one of the artificer infusions you learned with a new one."
			]
		},
		{
			"name": "Artificer Specialist",
			"source": "TCE",
			"page": 9,
			"otherSources": [
				{
					"source": "ERLW",
					"page": 54
				}
			],
			"className": "Artificer",
			"classSource": "TCE",
			"level": 3,
			"entries": [
				"At 3rd level, you choose the type of specialist you are, each of which is detailed at the end of the class's description. Your choice grants you features at 5th level and again at 9th and 15th level."
			]
		},
		{
			"name": "The Right Tool for the Job",
			"source": "TCE",
			"page": 9,
			"otherSources": [
				{
					"source": "ERLW",
					"page": 54
				}
			],
			"className": "Artificer",
			"classSource": "TCE",
			"level": 3,
			"entries": [
				"At 3rd level, you learn how to produce exactly the tool you need: with {@item thieves' tools|PHB} or {@item artisan's tools|PHB} in hand, you can magically create one set of {@item artisan's tools|PHB} in an unoccupied space within 5 feet of you. This creation requires 1 hour of uninterrupted work, which can coincide with a short or long rest. Though the product of magic, the tools are nonmagical, and they vanish when you use this feature again."
			]
		},
		{
			"name": "Ability Score Improvement",
			"source": "TCE",
			"page": 9,
			"otherSources": [
				{
					"source": "ERLW",
					"page": 54
				}
			],
			"className": "Artificer",
			"classSource": "TCE",
			"level": 4,
			"entries": [
				"When you reach 4th level, you can increase one ability score of your choice by 2, or you can increase two ability scores of your choice by 1. As normal, you can't increase an ability score above 20 using this feature.",
				"If your DM allows the use of feats, you may instead take a {@5etools feat|feats.html}."
			]
		},
		{
			"name": "Proficiency Versatility",
			"source": "UAClassFeatureVariants",
			"page": 1,
			"className": "Artificer",
			"classSource": "TCE",
			"level": 4,
			"isClassFeatureVariant": true,
			"entries": [
				"{@i 4th-level feature (enhances Ability Score Improvement)}",
				"When you gain the Ability Score Improvement feature from your class, you can also replace one of your skill proficiencies with a skill proficiency offered by your class at 1st level (the proficiency you replace needn't be from the class).",
				"This change represents one of your skills atrophying as you focus on a different skill."
			]
		},
		{
			"name": "Artificer Specialist Feature",
			"source": "TCE",
			"page": 9,
			"otherSources": [
				{
					"source": "ERLW",
					"page": 54
				}
			],
			"className": "Artificer",
			"classSource": "TCE",
			"level": 5,
			"entries": [
				"At 5th level, you gain a feature granted by your Artificer Specialist choice."
			]
		},
		{
			"name": "Tool Expertise",
			"source": "TCE",
			"page": 9,
			"otherSources": [
				{
					"source": "ERLW",
					"page": 54
				}
			],
			"className": "Artificer",
			"classSource": "TCE",
			"level": 6,
			"entries": [
				"Starting at 6th level, your proficiency bonus is doubled for any ability check you make that uses your proficiency with a tool."
			]
		},
		{
			"name": "Flash of Genius",
			"source": "TCE",
			"page": 9,
			"otherSources": [
				{
					"source": "ERLW",
					"page": 54
				}
			],
			"className": "Artificer",
			"classSource": "TCE",
			"level": 7,
			"entries": [
				"Starting at 7th level, you gain the ability to come up with solutions under pressure. When you or another creature you can see within 30 feet of you makes an ability check or a saving throw, you can use your reaction to add your Intelligence modifier to the roll.",
				"You can use this feature a number of times equal to your Intelligence modifier (minimum of once). You regain all expended uses when you finish a long rest."
			]
		},
		{
			"name": "Ability Score Improvement",
			"source": "TCE",
			"page": 9,
			"otherSources": [
				{
					"source": "ERLW",
					"page": 54
				}
			],
			"className": "Artificer",
			"classSource": "TCE",
			"level": 8,
			"entries": [
				"When you reach 8th level, you can increase one ability score of your choice by 2, or you can increase two ability scores of your choice by 1. As normal, you can't increase an ability score above 20 using this feature.",
				"If your DM allows the use of feats, you may instead take a {@5etools feat|feats.html}."
			]
		},
		{
			"name": "Proficiency Versatility",
			"source": "UAClassFeatureVariants",
			"page": 1,
			"className": "Artificer",
			"classSource": "TCE",
			"level": 8,
			"isClassFeatureVariant": true,
			"entries": [
				"{@i 8th-level feature (enhances Ability Score Improvement)}",
				"When you gain the Ability Score Improvement feature from your class, you can also replace one of your skill proficiencies with a skill proficiency offered by your class at 1st level (the proficiency you replace needn't be from the class).",
				"This change represents one of your skills atrophying as you focus on a different skill."
			]
		},
		{
			"name": "Artificer Specialist Feature",
			"source": "TCE",
			"page": 9,
			"otherSources": [
				{
					"source": "ERLW",
					"page": 54
				}
			],
			"className": "Artificer",
			"classSource": "TCE",
			"level": 9,
			"entries": [
				"At 9th level, you gain a feature granted by your Artificer Specialist choice."
			]
		},
		{
			"name": "Magic Item Adept",
			"source": "TCE",
			"page": 9,
			"otherSources": [
				{
					"source": "ERLW",
					"page": 54
				}
			],
			"className": "Artificer",
			"classSource": "TCE",
			"level": 10,
			"entries": [
				"When you reach 10th level, you achieve a profound understanding of how to use and make magic items:",
				{
					"type": "list",
					"items": [
						"You can attune to up to four magic items at once.",
						"If you craft a magic item with a rarity of common or uncommon, it takes you a quarter of the normal time, and it costs you half as much of the usual gold."
					]
				}
			]
		},
		{
			"name": "Spell-Storing Item",
			"source": "TCE",
			"page": 9,
			"otherSources": [
				{
					"source": "ERLW",
					"page": 54
				}
			],
			"className": "Artificer",
			"classSource": "TCE",
			"level": 11,
			"entries": [
				"At 11th level, you learn how to store a spell in an object. Whenever you finish a long rest, you can touch one {@filter simple or martial weapon|items|source=phb|category=basic|type=martial weapon;simple weapon} or one item that you can use as a spellcasting focus, and you store a spell in it, choosing a 1st- or 2nd-level spell from the {@filter artificer spell list|spells|class=Artificer|cast time=action|level=1;2} that requires 1 action to cast (you needn't have it prepared).",
				"While holding the object, a creature can take an action to produce the spell's effect from it, using your spellcasting ability modifier. If the spell requires concentration, the creature must concentrate. The spell stays in the object until it's been used a number of times equal to twice your Intelligence modifier (minimum of twice) or until you use this feature again to store a spell in an object."
			]
		},
		{
			"name": "Ability Score Improvement",
			"source": "TCE",
			"page": 9,
			"otherSources": [
				{
					"source": "ERLW",
					"page": 54
				}
			],
			"className": "Artificer",
			"classSource": "TCE",
			"level": 12,
			"entries": [
				"When you reach 12th level, you can increase one ability score of your choice by 2, or you can increase two ability scores of your choice by 1. As normal, you can't increase an ability score above 20 using this feature.",
				"If your DM allows the use of feats, you may instead take a {@5etools feat|feats.html}."
			]
		},
		{
			"name": "Proficiency Versatility",
			"source": "UAClassFeatureVariants",
			"page": 1,
			"className": "Artificer",
			"classSource": "TCE",
			"level": 12,
			"isClassFeatureVariant": true,
			"entries": [
				"{@i 12th-level feature (enhances Ability Score Improvement)}",
				"When you gain the Ability Score Improvement feature from your class, you can also replace one of your skill proficiencies with a skill proficiency offered by your class at 1st level (the proficiency you replace needn't be from the class).",
				"This change represents one of your skills atrophying as you focus on a different skill."
			]
		},
		{
			"name": "Magic Item Savant",
			"source": "TCE",
			"page": 9,
			"otherSources": [
				{
					"source": "ERLW",
					"page": 54
				}
			],
			"className": "Artificer",
			"classSource": "TCE",
			"level": 14,
			"entries": [
				"At 14th level, your skill with magic items deepens more:",
				{
					"type": "list",
					"items": [
						"You can attune to up to five magic items at once.",
						"You ignore all class, race, spell, and level requirements on attuning to or using a magic item."
					]
				}
			]
		},
		{
			"name": "Artificer Specialist Feature",
			"source": "TCE",
			"page": 9,
			"otherSources": [
				{
					"source": "ERLW",
					"page": 54
				}
			],
			"className": "Artificer",
			"classSource": "TCE",
			"level": 15,
			"entries": [
				"At 15th level, you gain a feature granted by your Artificer Specialist choice."
			]
		},
		{
			"name": "Ability Score Improvement",
			"source": "TCE",
			"page": 9,
			"otherSources": [
				{
					"source": "ERLW",
					"page": 54
				}
			],
			"className": "Artificer",
			"classSource": "TCE",
			"level": 16,
			"entries": [
				"When you reach 16th level, you can increase one ability score of your choice by 2, or you can increase two ability scores of your choice by 1. As normal, you can't increase an ability score above 20 using this feature.",
				"If your DM allows the use of feats, you may instead take a {@5etools feat|feats.html}."
			]
		},
		{
			"name": "Proficiency Versatility",
			"source": "UAClassFeatureVariants",
			"page": 1,
			"className": "Artificer",
			"classSource": "TCE",
			"level": 16,
			"isClassFeatureVariant": true,
			"entries": [
				"{@i 16th-level feature (enhances Ability Score Improvement)}",
				"When you gain the Ability Score Improvement feature from your class, you can also replace one of your skill proficiencies with a skill proficiency offered by your class at 1st level (the proficiency you replace needn't be from the class).",
				"This change represents one of your skills atrophying as you focus on a different skill."
			]
		},
		{
			"name": "Magic Item Master",
			"source": "TCE",
			"page": 9,
			"otherSources": [
				{
					"source": "ERLW",
					"page": 54
				}
			],
			"className": "Artificer",
			"classSource": "TCE",
			"level": 18,
			"entries": [
				"Starting at 18th level, you can attune to up to six magic items at once."
			]
		},
		{
			"name": "Ability Score Improvement",
			"source": "TCE",
			"page": 9,
			"otherSources": [
				{
					"source": "ERLW",
					"page": 54
				}
			],
			"className": "Artificer",
			"classSource": "TCE",
			"level": 19,
			"entries": [
				"When you reach 19th level, you can increase one ability score of your choice by 2, or you can increase two ability scores of your choice by 1. As normal, you can't increase an ability score above 20 using this feature.",
				"If your DM allows the use of feats, you may instead take a {@5etools feat|feats.html}."
			]
		},
		{
			"name": "Proficiency Versatility",
			"source": "UAClassFeatureVariants",
			"page": 1,
			"className": "Artificer",
			"classSource": "TCE",
			"level": 19,
			"isClassFeatureVariant": true,
			"entries": [
				"{@i 19th-level feature (enhances Ability Score Improvement)}",
				"When you gain the Ability Score Improvement feature from your class, you can also replace one of your skill proficiencies with a skill proficiency offered by your class at 1st level (the proficiency you replace needn't be from the class).",
				"This change represents one of your skills atrophying as you focus on a different skill."
			]
		},
		{
			"name": "Soul of Artifice",
			"source": "TCE",
			"page": 9,
			"otherSources": [
				{
					"source": "ERLW",
					"page": 54
				}
			],
			"className": "Artificer",
			"classSource": "TCE",
			"level": 20,
			"entries": [
				"At 20th level, you develop a mystical connection to your magic items, which you can draw on for protection:",
				{
					"type": "list",
					"items": [
						"You gain a +1 bonus to all saving throws per magic item you are currently attuned to.",
						"If you're reduced to 0 hit points but not killed outright, you can use your reaction to end one of your artificer infusions, causing you to drop to 1 hit point instead of 0."
					]
				}
			]
		},
		{
			"name": "Artificer Specialist",
			"source": "UAArtificer",
			"page": 1,
			"className": "Artificer",
			"classSource": "UAArtificer",
			"level": 1,
			"entries": [
				"At 1st level, you choose the type of Artificer Specialist you are from the list of available specialisations. Your choice grants you features at 1st level and again at 3rd, 9th, 14th, and 17th level."
			]
		},
		{
			"name": "Magic Item Analysis",
			"source": "UAArtificer",
			"page": 1,
			"className": "Artificer",
			"classSource": "UAArtificer",
			"level": 1,
			"entries": [
				"Starting at 1st level, your understanding of magic items allows you to analyze and understand their secrets. You know the artificer spells {@spell detect magic} and {@spell identify}, and you can cast them as rituals. You don't need to provide a material component when casting {@spell identify} with this class feature."
			]
		},
		{
			"name": "Tool Expertise",
			"source": "UAArtificer",
			"page": 1,
			"className": "Artificer",
			"classSource": "UAArtificer",
			"level": 2,
			"entries": [
				"Starting at 2nd level, your proficiency bonus is doubled for any ability check you make that uses any of the tool proficiencies you gain from this class."
			]
		},
		{
			"name": "Wondrous Invention",
			"source": "UAArtificer",
			"page": 1,
			"className": "Artificer",
			"classSource": "UAArtificer",
			"level": 2,
			"entries": [
				"At 2nd level, you gain the use of a magic item that you have crafted. Choose the item from the list of 2nd-level items below. Crafting an item is a difficult task. When you gain a magic item from this feature, it reflects long hours of study, tinkering, and experimentation that allowed you to finally complete the item. You are assumed to work on this item in your leisure time and to finish it when you level up. You complete another item of your choice when you reach certain levels in this class: 5th, 10th, 15th, and 20th level. The item you choose must be on the list for your current artificer level or a lower level. These magic items are detailed in the Dungeon Master's Guide.",
				{
					"type": "entries",
					"name": "2nd Level",
					"entries": [
						"{@item Bag of holding}, {@item cap of water breathing}, {@item driftglobe}, {@item goggles of night}, {@item sending stones}"
					]
				},
				{
					"type": "entries",
					"name": "5th Level",
					"entries": [
						"{@item Alchemy jug}, {@item helm of comprehending languages}, {@item lantern of revealing}, {@item ring of swimming}, {@item robe of useful items}, {@item rope of climbing}, {@item wand of magic detection}, {@item wand of secrets}"
					]
				},
				{
					"type": "entries",
					"name": "10th Level",
					"entries": [
						"{@item Bag of beans}, {@item chime of opening}, {@item decanter of endless water}, {@item eyes of minute seeing}, {@item folding boat}, {@item Heward's handy haversack}"
					]
				},
				{
					"type": "entries",
					"name": "15th Level",
					"entries": [
						"{@item Boots of striding and springing}, {@item bracers of archery}, {@item brooch of shielding}, {@item broom of flying}, {@item hat of disguise}, {@item slippers of spider climbing}"
					]
				},
				{
					"type": "entries",
					"name": "20th Level",
					"entries": [
						"{@item Eyes of the eagle}, {@item gem of brightness}, {@item gloves of missile snaring}, {@item gloves of swimming and climbing}, {@item ring of jumping}, {@item ring of mind shielding}, {@item wings of flying}"
					]
				}
			]
		},
		{
			"name": "Masterwork Feature",
			"source": "UAArtificer",
			"page": 1,
			"className": "Artificer",
			"classSource": "UAArtificer",
			"level": 3,
			"entries": [
				"At 3rd level, you gain a feature from your Artificer Specialist."
			]
		},
		{
			"name": "Spellcasting",
			"source": "UAArtificer",
			"page": 1,
			"className": "Artificer",
			"classSource": "UAArtificer",
			"level": 3,
			"entries": [
				"As part of your study of magic, you gain the ability to cast spells at 3rd level. The spells you learn are limited in scope, primarily concerned with modifying creatures and objects or creating items.",
				{
					"type": "entries",
					"name": "Spell Slots",
					"entries": [
						"The Artificer table shows how many spell slots you have to cast your spells of 1st level and higher. To cast one of these spells, you must expend a slot of the spell's level or higher. You regain all expended spell slots when you finish a long rest."
					]
				},
				{
					"type": "entries",
					"name": "Spells Known of 1st Level and Higher",
					"entries": [
						"You know three 1st-level spells of your choice from the artificer spell list (which appears at the end of this document). The Spells Known column of the Artificer table shows when you learn more artificer spells of your choice from this feature. Each of these spells must be of a level for which you have spell slots on the Artificer table. Additionally, when you gain a level in this class, you can choose one of the artificer spells you know from this feature and replace it with another spell from the artificer spell list. The new spell must also be of a level for which you have spell slots on the Artificer table."
					]
				},
				{
					"type": "entries",
					"name": "Spellcasting Ability",
					"entries": [
						"Intelligence is your spellcasting ability for your artificer spells; your understanding of the theory behind magic allows you to wield these spells with superior skill. You use your Intelligence whenever an artificer spell refers to your spellcasting ability. In addition, you use your Intelligence modifier when setting the saving throw DC for an artificer spell you cast and when making an attack roll with one.",
						{
							"type": "abilityDc",
							"name": "Spell",
							"attributes": [
								"int"
							]
						},
						{
							"type": "abilityAttackMod",
							"name": "Spell",
							"attributes": [
								"int"
							]
						}
					]
				},
				{
					"type": "entries",
					"name": "Spellcasting Focus",
					"entries": [
						"You can use an {@item arcane focus|phb} as a spellcasting focus for your artificer spells. See chapter 5, \"Equipment,\" in the Player's Handbook for various arcane focus options."
					]
				}
			]
		},
		{
			"name": "Ability Score Improvement",
			"source": "UAArtificer",
			"page": 1,
			"className": "Artificer",
			"classSource": "UAArtificer",
			"level": 4,
			"entries": [
				"When you reach 4th, 8th, 12th, 16th, and 18th level, you can increase one ability score of your choice by 2, or you can increase two ability scores of your choice by 1. As normal, you can't increase an ability score above 20 using this feature."
			]
		},
		{
			"name": "Infuse Magic",
			"source": "UAArtificer",
			"page": 1,
			"className": "Artificer",
			"classSource": "UAArtificer",
			"level": 4,
			"entries": [
				"Starting at 4th level, you gain the ability to channel your artificer spells into objects for later use. When you cast an artificer spell with a casting time of 1 action, you can increase its casting time to 1 minute. If you do so and hold a nonmagical item throughout the casting, you expend a spell slot, but none of the spell's effects occur. Instead, the spell transfers into that item for later use if the item doesn't already contain a spell from this feature.",
				"Any creature holding the item thereafter can use an action to activate the spell if the creature has an Intelligence score of at least 6. The spell is cast using your spellcasting ability, targeting the creature that activates the item. If the spell targets more than one creature, the creature that activates the item selects the additional targets. If the spell has an area of effect, it is centered on the item. If the spell's range is self, it targets the creature that activates the item.",
				"When you infuse a spell in this way, it must be used within 8 hours. After that time, its magic fades and is wasted. You can have a limited number of infused spells at the same time. The number equals your Intelligence modifier."
			]
		},
		{
			"name": "Proficiency Versatility",
			"source": "UAClassFeatureVariants",
			"page": 1,
			"className": "Artificer",
			"classSource": "UAArtificer",
			"level": 4,
			"isClassFeatureVariant": true,
			"entries": [
				"{@i 4th-level feature (enhances Ability Score Improvement)}",
				"When you gain the Ability Score Improvement feature from your class, you can also replace one of your skill proficiencies with a skill proficiency offered by your class at 1st level (the proficiency you replace needn't be from the class).",
				"This change represents one of your skills atrophying as you focus on a different skill."
			]
		},
		{
			"name": "Superior Attunement",
			"source": "UAArtificer",
			"page": 1,
			"className": "Artificer",
			"classSource": "UAArtificer",
			"level": 5,
			"entries": [
				"At 5th level, your superior understanding of magic items allows you to master their use. You can now attune to up to four, rather than three, magic items at a time. At 15th level, this limit increases to five magic items."
			]
		},
		{
			"name": "Wondrous Invention",
			"source": "UAArtificer",
			"page": 1,
			"className": "Artificer",
			"classSource": "UAArtificer",
			"level": 5,
			"entries": [
				"At 5th level, you craft another item from your Wondrous Invention feature."
			]
		},
		{
			"name": "Mechanical Servant",
			"source": "UAArtificer",
			"page": 1,
			"className": "Artificer",
			"classSource": "UAArtificer",
			"level": 6,
			"entries": [
				"At 6th level, your research and mastery of your craft allow you to produce a mechanical servant. The servant is a construct that obeys your commands without hesitation and functions in combat to protect you. Though magic fuels its creation, the servant is not magical itself. You are assumed to have been working on the servant for quite some time, finally finishing it during a short or long rest after you reach 6th level.",
				"Select a Large beast with a challenge rating of 2 or less. The servant uses that beast's game statistics, but it can look however you like, as long as its form is appropriate for its statistics. It has the following modifications:",
				{
					"type": "list",
					"items": [
						"It is a construct instead of a beast.",
						"It can't be {@condition charmed}.",
						"It is immune to poison damage and the {@condition poisoned} condition.",
						"It gains {@sense darkvision} with a range of 60 feet if it doesn't have it already.",
						"It understands the languages you can speak when you create it, but it can't speak.",
						"If you are the target of a melee attack and the servant is within 5 feet of the attacker, you can use your reaction to command the servant to respond, using its reaction to make a melee attack against the attacker."
					]
				},
				"The servant obeys your orders to the best of its ability. In combat, it rolls its own initiative and acts on its own.",
				"If the servant is killed, it can be returned to life via normal means, such as with the {@spell revivify} spell. In addition, over the course of a long rest, you can repair a slain servant if you have access to its body. It returns to life with 1 hit point at the end of the rest. If the servant is beyond recovery, you can build a new one with one week of work (eight hours each day) and 1,000 gp of raw materials."
			]
		},
		{
			"name": "Ability Score Improvement",
			"source": "UAArtificer",
			"page": 1,
			"className": "Artificer",
			"classSource": "UAArtificer",
			"level": 8,
			"entries": [
				"At 8th level, you gain another Ability Score Improvement."
			]
		},
		{
			"name": "Proficiency Versatility",
			"source": "UAClassFeatureVariants",
			"page": 1,
			"className": "Artificer",
			"classSource": "UAArtificer",
			"level": 8,
			"isClassFeatureVariant": true,
			"entries": [
				"{@i 8th-level feature (enhances Ability Score Improvement)}",
				"When you gain the Ability Score Improvement feature from your class, you can also replace one of your skill proficiencies with a skill proficiency offered by your class at 1st level (the proficiency you replace needn't be from the class).",
				"This change represents one of your skills atrophying as you focus on a different skill."
			]
		},
		{
			"name": "Masterwork Feature",
			"source": "UAArtificer",
			"page": 1,
			"className": "Artificer",
			"classSource": "UAArtificer",
			"level": 9,
			"entries": [
				"At 9th level, you gain a feature from your Artificer Specialist."
			]
		},
		{
			"name": "Wondrous Invention",
			"source": "UAArtificer",
			"page": 1,
			"className": "Artificer",
			"classSource": "UAArtificer",
			"level": 10,
			"entries": [
				"At 10th level, you craft another item from your Wondrous Invention feature."
			]
		},
		{
			"name": "Ability Score Improvement",
			"source": "UAArtificer",
			"page": 1,
			"className": "Artificer",
			"classSource": "UAArtificer",
			"level": 12,
			"entries": [
				"At 12th level, you gain another Ability Score Improvement."
			]
		},
		{
			"name": "Proficiency Versatility",
			"source": "UAClassFeatureVariants",
			"page": 1,
			"className": "Artificer",
			"classSource": "UAArtificer",
			"level": 12,
			"isClassFeatureVariant": true,
			"entries": [
				"{@i 12th-level feature (enhances Ability Score Improvement)}",
				"When you gain the Ability Score Improvement feature from your class, you can also replace one of your skill proficiencies with a skill proficiency offered by your class at 1st level (the proficiency you replace needn't be from the class).",
				"This change represents one of your skills atrophying as you focus on a different skill."
			]
		},
		{
			"name": "Masterwork Feature",
			"source": "UAArtificer",
			"page": 1,
			"className": "Artificer",
			"classSource": "UAArtificer",
			"level": 14,
			"entries": [
				"At 14th level, you gain a feature from your Artificer Specialist."
			]
		},
		{
			"name": "Superior Attunement",
			"source": "UAArtificer",
			"page": 1,
			"className": "Artificer",
			"classSource": "UAArtificer",
			"level": 15,
			"entries": [
				"Starting at 15th level, you can attune to up to five magic items."
			]
		},
		{
			"name": "Wondrous Invention",
			"source": "UAArtificer",
			"page": 1,
			"className": "Artificer",
			"classSource": "UAArtificer",
			"level": 15,
			"entries": [
				"At 15th level, you craft another item from your Wondrous Invention feature."
			]
		},
		{
			"name": "Ability Score Improvement",
			"source": "UAArtificer",
			"page": 1,
			"className": "Artificer",
			"classSource": "UAArtificer",
			"level": 16,
			"entries": [
				"At 16th level, you gain another Ability Score Improvement."
			]
		},
		{
			"name": "Proficiency Versatility",
			"source": "UAClassFeatureVariants",
			"page": 1,
			"className": "Artificer",
			"classSource": "UAArtificer",
			"level": 16,
			"isClassFeatureVariant": true,
			"entries": [
				"{@i 16th-level feature (enhances Ability Score Improvement)}",
				"When you gain the Ability Score Improvement feature from your class, you can also replace one of your skill proficiencies with a skill proficiency offered by your class at 1st level (the proficiency you replace needn't be from the class).",
				"This change represents one of your skills atrophying as you focus on a different skill."
			]
		},
		{
			"name": "Masterwork Feature",
			"source": "UAArtificer",
			"page": 1,
			"className": "Artificer",
			"classSource": "UAArtificer",
			"level": 17,
			"entries": [
				"At 17th level, you gain a feature from your Artificer Specialist."
			]
		},
		{
			"name": "Ability Score Improvement",
			"source": "UAArtificer",
			"page": 1,
			"className": "Artificer",
			"classSource": "UAArtificer",
			"level": 18,
			"entries": [
				"At 18th level, you gain another Ability Score Improvement."
			]
		},
		{
			"name": "Proficiency Versatility",
			"source": "UAClassFeatureVariants",
			"page": 1,
			"className": "Artificer",
			"classSource": "UAArtificer",
			"level": 18,
			"isClassFeatureVariant": true,
			"entries": [
				"{@i 18th-level feature (enhances Ability Score Improvement)}",
				"When you gain the Ability Score Improvement feature from your class, you can also replace one of your skill proficiencies with a skill proficiency offered by your class at 1st level (the proficiency you replace needn't be from the class).",
				"This change represents one of your skills atrophying as you focus on a different skill."
			]
		},
		{
			"name": "Soul of Artifice",
			"source": "UAArtificer",
			"page": 1,
			"className": "Artificer",
			"classSource": "UAArtificer",
			"level": 20,
			"entries": [
				"At 20th level, your understanding of magic items is unmatched, allowing you to mingle your soul with items linked to you. You can attune to up to six magic items at once. In addition, you gain a +1 bonus to all saving throws per magic item you are currently attuned to."
			]
		},
		{
			"name": "Magical Tinkering",
			"source": "UAArtificerRevisited",
			"page": 1,
			"className": "Artificer (Revisited)",
			"classSource": "UAArtificerRevisited",
			"level": 1,
			"entries": [
				"At 1st level, you learn how to invest a spark of magic in objects that would otherwise be mundane. To use this ability, you must have {@item thieves' tools|PHB}, {@item tinker's tools|PHB}, or other {@item artisan's tools|PHB} in hand. You then touch a Tiny nonmagical object as an action and give it one of the following magical properties of your choice:",
				{
					"type": "list",
					"items": [
						"The object sheds bright light in a 5-foot radius and dim light for an additional 5 feet.",
						"Whenever tapped by a creature, the object emits a recorded message that can be heard up to 10 feet away. You utter the message when you bestow this property on the object, and the recording can be no more than 6 seconds long.",
						"The object continuously emits your choice of an odor or a nonverbal sound (wind, waves, chirping, or the like). The chosen phenomenon is perceivable up to 10 feet away.",
						"A static visual effect appears on one of the object's surfaces. This effect can be a picture, up to 25 words of text, lines and shapes, or a mixture of these elements, as you like."
					]
				},
				"The chosen property lasts indefinitely. As an action, you can touch the object and end the property early.",
				"You can give the magic of this feature to multiple objects, touching one object each time you use the feature, and a single object can bear only one of the properties at a time. The maximum number of objects you can affect with the feature at one time is equal to your Intelligence modifier (minimum of one object). If you try to exceed your maximum, the oldest property immediately ends, and then the new property applies."
			]
		},
		{
			"name": "Spellcasting",
			"source": "UAArtificerRevisited",
			"page": 1,
			"className": "Artificer (Revisited)",
			"classSource": "UAArtificerRevisited",
			"level": 1,
			"entries": [
				"You have studied the workings of magic, how to channel it through objects, and how to awaken it within them. As a result, you have gained a limited ability to cast spells. To observers, you don't appear to be casting spells in a conventional way; you look as if you're producing wonders through various items.",
				{
					"type": "entries",
					"name": "Tools Required",
					"entries": [
						"You produce your artificer spell effects through your tools. You must have a spellcasting focus—specifically {@item thieves' tools|phb} or some kind of artisan's tool—in hand when you cast any spell with this Spellcasting feature. You must be proficient with the tool to use it in this way. See chapter 5, \"{@book Equipment|phb|6|tools},\" in the Player's Handbook for descriptions of these tools.",
						"After you gain the Infuse Item feature at 2nd level, you can also use any item bearing one of your infusions as a spellcasting focus."
					]
				},
				{
					"type": "entries",
					"name": "Cantrips",
					"entries": [
						"At 1st level, you know two cantrips of your choice from the {@filter artificer spell list|spells|class=artificer (uaar)}. At higher levels, you learn additional artificer cantrips of your choice, as shown in the Cantrips Known column of the Artificer table.",
						"When you gain a level in this class, you can replace one of the artificer cantrips you know with another cantrip from the artificer spell list."
					]
				},
				{
					"type": "entries",
					"name": "Preparing and Casting Spells",
					"entries": [
						"The Artificer table shows how many spell slots you have to cast your artificer spells. To cast one of your artificer spells of 1st level or higher, you must expend a slot of the spell's level or higher. You regain all expended spell slots when you finish a long rest.",
						"You prepare the list of artificer spells that are available for you to cast, choosing from the {@filter artificer spell list|spells|class=artificer (uaar)}. When you do so, choose a number of artificer spells equal to your Intelligence modifier + half your artificer level, rounded down (minimum of one spell). The spells must be of a level for which you have spell slots.",
						"For example, if you are a 5th-level artificer, you have four 1st-level and two 2nd-level spell slots. With an Intelligence of 14, your list of prepared spells can include four spells of 1st or 2nd level, in any combination. If you prepare the 1st-level spell {@spell cure wounds}, you can cast it using a 1st-level or a 2nd-level slot. Casting the spell doesn't remove it from your list of prepared spells.",
						"You can change your list of prepared spells when you finish a long rest. Preparing a new list of artificer spells requires time spent in tinkering with your spellcasting focuses: at least 1 minute per spell level for each spell on your list."
					]
				},
				{
					"type": "entries",
					"name": "Spellcasting Ability",
					"entries": [
						"Intelligence is your spellcasting ability for your artificer spells; your understanding of the theory behind magic allows you to wield these spells with superior skill. You use your Intelligence whenever an artificer spell refers to your spellcasting ability. In addition, you use your Intelligence modifier when setting the saving throw DC for an artificer spell you cast and when making an attack roll with one.",
						{
							"type": "abilityDc",
							"name": "Spell",
							"attributes": [
								"int"
							]
						},
						{
							"type": "abilityAttackMod",
							"name": "Spell",
							"attributes": [
								"int"
							]
						}
					]
				},
				{
					"type": "entries",
					"name": "Ritual Casting",
					"entries": [
						"You can cast an artificer spell as a ritual if that spell has the ritual tag and you have the spell prepared."
					]
				},
				{
					"type": "inset",
					"name": "The Magic of Artifice",
					"entries": [
						"As an artificer, you use tools when you cast your spells. When describing your spellcasting, think about how you're using a tool to perform the spell effect. If you cast {@spell cure wounds} using {@item alchemist's supplies|PHB}, you could be quickly producing a salve. If you cast it using {@item tinker's tools|phb}, you might have a miniature mechanical spider that binds wounds. When you cast {@spell poison spray}, you could fling foul chemicals or use a wand that spits venom. The effect of the spell is the same as for a spellcaster of any other class, but your method of spellcasting is special.",
						"The same principle applies when you prepare your spells. As an artificer, you don't study a spellbook or pray to prepare your spells. Instead, you work with your tools and create the specialized items you'll use to produce your effects. If you replace {@spell cure wounds} with {@spell shocking grasp}, you might be breaking down the device you used to heal and creating an offensive item in its place—perhaps a gauntlet that lets you channel a surge of energy.",
						"Such details don't limit you in any way or provide you with any benefit. You don't have to justify how you're using tools to cast a spell. But describing your spellcasting creatively is a fun way to distinguish yourself from other spellcasters."
					]
				}
			]
		},
		{
			"name": "Infuse Item",
			"source": "UAArtificerRevisited",
			"page": 1,
			"className": "Artificer (Revisited)",
			"classSource": "UAArtificerRevisited",
			"level": 2,
			"entries": [
				"At 2nd level, you gain the ability to imbue mundane items with certain magical infusions. The magic items you create with this feature are effectively prototypes of permanent items.",
				{
					"type": "entries",
					"name": "Infusions Known",
					"entries": [
						"When you gain this feature, pick three artificer infusions to learn, choosing from the \"{@filter Artificer Infusions|optionalfeatures|feature type=ai|source=UAArtificerRevisited}\" section at the end of the class's description. You learn additional infusions of your choice when you reach certain levels in this class, as shown in the Infusions Known column of the Artificer table.",
						"Whenever you gain a level in this class, you can replace one of the artificer infusions you learned with a new one."
					]
				},
				{
					"type": "entries",
					"name": "Infusing an Item",
					"entries": [
						"Whenever you finish a long rest, you can touch a nonmagical object and imbue it with one of your artificer infusions, turning it into a magic item. An infusion works on only certain kinds of objects, as specified in the infusion's description. If the item requires attunement, you can attune yourself to it the instant you infuse the item, or you can forgo attunement so that someone else can attune to the item. If you decide to attune to the item later, you must do so using the normal process for attunement (see \"{@book Attunement|dmg|7|attunement}\" in the Dungeon Master's Guide, page 136).",
						"Your infusion remains in an item indefinitely, but when you die, the infusion vanishes after a number of days have passed equal to your Intelligence modifier (minimum of 1 day). The infusion also vanishes if you give up your knowledge of the infusion for another one.",
						"You can infuse more than one nonmagical object at the end of a long rest; the maximum number of objects appears in the Infused Items column of the Artificer table. You must touch each of the objects, and each of your infusions can be in only one object at a time. If you try to exceed your maximum number of infusions, the oldest infusion immediately ends, and then the new infusion applies."
					]
				},
				{
					"type": "inset",
					"name": "Artificer Infusions",
					"entries": [
						"Artificers have invented numerous magical infusions that rapidly create magic items. To the untrained, artificers seem like wonderworkers, accomplishing in hours what others need weeks to complete.",
						"The description of each infusion tells you the type of item that can receive it. The description also tells you if the resulting magic item requires attunement.",
						"Some infusions specify a minimum artificer level. You can't learn such an infusion until you are at least that level.",
						"Unless an infusion's description says otherwise, you can't learn the infusion more than once.",
						"See the {@filter Class Feature Options page|optionalfeatures|feature type=ai|source=UAArtificerRevisited} for the full list of infusions."
					]
				}
			]
		},
		{
			"name": "Artificer Specialist",
			"source": "UAArtificerRevisited",
			"page": 1,
			"className": "Artificer (Revisited)",
			"classSource": "UAArtificerRevisited",
			"level": 3,
			"entries": [
				"At 3rd level, you choose the type of specialist you are: Alchemist, Archivist, or Artillerist, or Battle Smith, each of which is detailed at the end of the class's description. Your choice grants you features at 3rd level and again at 6th and 14th level.",
				{
					"type": "inset",
					"name": "Variant: Crafting",
					"entries": [
						"An artificer subclass makes you more efficient at crafting certain items. The feature you get from your subclass works whether you're using the crafting rules in the {@book Player's Handbook|phb|8|crafting}, {@book Dungeon Master's Guide|dmg|6|crafting a magic item}, or {@book Xanathar's Guide to Everything|xge|2|crafting an item}."
					]
				}
			]
		},
		{
			"name": "Tool Expertise",
			"source": "UAArtificerRevisited",
			"page": 1,
			"className": "Artificer (Revisited)",
			"classSource": "UAArtificerRevisited",
			"level": 3,
			"entries": [
				"Starting at 3rd level, your proficiency bonus is doubled for any ability check you make that uses your proficiency with a tool."
			]
		},
		{
			"name": "Ability Score Improvement",
			"source": "UAArtificerRevisited",
			"page": 1,
			"className": "Artificer (Revisited)",
			"classSource": "UAArtificerRevisited",
			"level": 4,
			"entries": [
				"When you reach 4th level, you can increase one ability score of your choice by 2, or you can increase two ability scores of your choice by 1. As normal, you can't increase an ability score above 20 using this feature.",
				"If your DM allows the use of feats, you may instead take a {@5etools feat|feats.html}."
			]
		},
		{
			"name": "Proficiency Versatility",
			"source": "UAClassFeatureVariants",
			"page": 1,
			"className": "Artificer (Revisited)",
			"classSource": "UAArtificerRevisited",
			"level": 4,
			"isClassFeatureVariant": true,
			"entries": [
				"{@i 4th-level feature (enhances Ability Score Improvement)}",
				"When you gain the Ability Score Improvement feature from your class, you can also replace one of your skill proficiencies with a skill proficiency offered by your class at 1st level (the proficiency you replace needn't be from the class).",
				"This change represents one of your skills atrophying as you focus on a different skill."
			]
		},
		{
			"name": "Arcane Armament",
			"source": "UAArtificerRevisited",
			"page": 1,
			"className": "Artificer (Revisited)",
			"classSource": "UAArtificerRevisited",
			"level": 5,
			"entries": [
				"Starting at 5th level, you can attack twice, rather than once, whenever you take the {@action Attack} action on your turn, but one of the attacks must be made with a magic weapon, the magic of which you use to propel the attack."
			]
		},
		{
			"name": "Artificer Specialist Feature",
			"source": "UAArtificerRevisited",
			"page": 1,
			"className": "Artificer (Revisited)",
			"classSource": "UAArtificerRevisited",
			"level": 6,
			"entries": [
				"At 6th level, you gain a feature granted by your Artificer Specialist choice."
			]
		},
		{
			"name": "Ability Score Improvement",
			"source": "UAArtificerRevisited",
			"page": 1,
			"className": "Artificer (Revisited)",
			"classSource": "UAArtificerRevisited",
			"level": 8,
			"entries": [
				"When you reach 8th level, you can increase one ability score of your choice by 2, or you can increase two ability scores of your choice by 1. As normal, you can't increase an ability score above 20 using this feature.",
				"If your DM allows the use of feats, you may instead take a {@5etools feat|feats.html}."
			]
		},
		{
			"name": "Proficiency Versatility",
			"source": "UAClassFeatureVariants",
			"page": 1,
			"className": "Artificer (Revisited)",
			"classSource": "UAArtificerRevisited",
			"level": 8,
			"isClassFeatureVariant": true,
			"entries": [
				"{@i 8th-level feature (enhances Ability Score Improvement)}",
				"When you gain the Ability Score Improvement feature from your class, you can also replace one of your skill proficiencies with a skill proficiency offered by your class at 1st level (the proficiency you replace needn't be from the class).",
				"This change represents one of your skills atrophying as you focus on a different skill."
			]
		},
		{
			"name": "The Right Cantrip for the Job",
			"source": "UAArtificerRevisited",
			"page": 1,
			"className": "Artificer (Revisited)",
			"classSource": "UAArtificerRevisited",
			"level": 10,
			"entries": [
				"At 10th level, you gain the ability to make sure you have the right magical tool for a job. Whenever you finish a short or long rest, you can replace one of the artificer cantrips you know with another cantrip from the {@filter artificer spell list|spells|class=artificer (uaar)}."
			]
		},
		{
			"name": "Ability Score Improvement",
			"source": "UAArtificerRevisited",
			"page": 1,
			"className": "Artificer (Revisited)",
			"classSource": "UAArtificerRevisited",
			"level": 12,
			"entries": [
				"When you reach 12th level, you can increase one ability score of your choice by 2, or you can increase two ability scores of your choice by 1. As normal, you can't increase an ability score above 20 using this feature.",
				"If your DM allows the use of feats, you may instead take a {@5etools feat|feats.html}."
			]
		},
		{
			"name": "Proficiency Versatility",
			"source": "UAClassFeatureVariants",
			"page": 1,
			"className": "Artificer (Revisited)",
			"classSource": "UAArtificerRevisited",
			"level": 12,
			"isClassFeatureVariant": true,
			"entries": [
				"{@i 12th-level feature (enhances Ability Score Improvement)}",
				"When you gain the Ability Score Improvement feature from your class, you can also replace one of your skill proficiencies with a skill proficiency offered by your class at 1st level (the proficiency you replace needn't be from the class).",
				"This change represents one of your skills atrophying as you focus on a different skill."
			]
		},
		{
			"name": "Artificer Specialist Feature",
			"source": "UAArtificerRevisited",
			"page": 1,
			"className": "Artificer (Revisited)",
			"classSource": "UAArtificerRevisited",
			"level": 14,
			"entries": [
				"At 14th level, you gain a feature granted by your Artificer Specialist choice."
			]
		},
		{
			"name": "Ability Score Improvement",
			"source": "UAArtificerRevisited",
			"page": 1,
			"className": "Artificer (Revisited)",
			"classSource": "UAArtificerRevisited",
			"level": 16,
			"entries": [
				"When you reach 16th level, you can increase one ability score of your choice by 2, or you can increase two ability scores of your choice by 1. As normal, you can't increase an ability score above 20 using this feature.",
				"If your DM allows the use of feats, you may instead take a {@5etools feat|feats.html}."
			]
		},
		{
			"name": "Proficiency Versatility",
			"source": "UAClassFeatureVariants",
			"page": 1,
			"className": "Artificer (Revisited)",
			"classSource": "UAArtificerRevisited",
			"level": 16,
			"isClassFeatureVariant": true,
			"entries": [
				"{@i 16th-level feature (enhances Ability Score Improvement)}",
				"When you gain the Ability Score Improvement feature from your class, you can also replace one of your skill proficiencies with a skill proficiency offered by your class at 1st level (the proficiency you replace needn't be from the class).",
				"This change represents one of your skills atrophying as you focus on a different skill."
			]
		},
		{
			"name": "Spell-Storing Item",
			"source": "UAArtificerRevisited",
			"page": 1,
			"className": "Artificer (Revisited)",
			"classSource": "UAArtificerRevisited",
			"level": 18,
			"entries": [
				"When you reach 18th level, you learn how to store a spell in an object for repeated use. Whenever you finish a long rest, you can touch one simple or martial weapon or an item that you can use as a spellcasting focus and store a spell in it, choosing one 1st- or 2nd-level spell from the {@filter artificer spell list|spells|class=artificer (uaar)|cast time=action|level=1;2} that requires 1 action to cast (you don't need to have the spell prepared). With the object in hand, a creature can take an action to produce the spell's effect from it, using your spellcasting ability modifier.",
				"The spell stays in the object until it has been used a number of times equal to twice your Intelligence modifier (minimum of twice) or until you use this feature again."
			]
		},
		{
			"name": "Ability Score Improvement",
			"source": "UAArtificerRevisited",
			"page": 1,
			"className": "Artificer (Revisited)",
			"classSource": "UAArtificerRevisited",
			"level": 19,
			"entries": [
				"When you reach 19th level, you can increase one ability score of your choice by 2, or you can increase two ability scores of your choice by 1. As normal, you can't increase an ability score above 20 using this feature.",
				"If your DM allows the use of feats, you may instead take a {@5etools feat|feats.html}."
			]
		},
		{
			"name": "Proficiency Versatility",
			"source": "UAClassFeatureVariants",
			"page": 1,
			"className": "Artificer (Revisited)",
			"classSource": "UAArtificerRevisited",
			"level": 19,
			"isClassFeatureVariant": true,
			"entries": [
				"{@i 19th-level feature (enhances Ability Score Improvement)}",
				"When you gain the Ability Score Improvement feature from your class, you can also replace one of your skill proficiencies with a skill proficiency offered by your class at 1st level (the proficiency you replace needn't be from the class).",
				"This change represents one of your skills atrophying as you focus on a different skill."
			]
		},
		{
			"name": "Soul of Artifice",
			"source": "UAArtificerRevisited",
			"page": 1,
			"className": "Artificer (Revisited)",
			"classSource": "UAArtificerRevisited",
			"level": 20,
			"entries": [
				"At 20th level, your understanding of magic items is unmatched, allowing you to mingle your soul with items linked to you. You can attune to up to six magic items at once. In addition, you gain a +1 bonus to all saving throws per magic item you are currently attuned to."
			]
		}
	]